Repository: hansukedev/love_sync
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Settings
vi: Cài đặt

source: Account
vi: Tài khoản

source: Appearance
vi: Giao diện

source: General
vi: Cài đặt chung

source: Danger Zone
vi: Vùng nguy hiểm

source: Edit Display Name
vi: Đổi tên hiển thị

source: Dark Mode
vi: Chế độ tối

source: Notifications
vi: Thông báo

source: Language
vi: Ngôn ngữ

source: Location Sharing
vi: Chia sẻ vị trí

source: Coming soon
vi: Sắp ra mắt

source: Unpair
vi: Hủy kết đôi

source: Log Out
vi: Đăng xuất

source: Cancel
vi: Hủy

source: Save
vi: Lưu

source: Enter your name
vi: Tên của bạn

# unpairConfirmationTitle
source: Unpair?
vi: Hủy kết đôi?

# unpairConfirmationContent
source: Are you sure you want to leave this relationship? This action cannot be undone.
vi: Bạn có chắc chắn muốn rời khỏi mối quan hệ này? Hành động này không thể hoàn tác.

# unpairAction
source: Unpair
vi: Hủy kết đôi

# daysTogether
source: Days
vi: Ngày

source: Together
vi: Bên nhau

source: Anniversary
vi: Kỷ niệm

source: Tap to pick date
vi: Chạm để chọn ngày

# partnerFeeling
source: Partner is feeling:
vi: Người ấy đang:

source: (Didn't say anything)
vi: (Chưa nói gì cả)

# yourFeeling
source: How are you feeling?
vi: Cảm xúc của bạn:

# whyFeeling
source: Why do you feel this way?
vi: Tại sao bạn vui/buồn?

source: Update Mood
vi: Cập nhật cảm xúc

source: Sending...
vi: Đang gửi...

source: Mood updated!
vi: Đã cập nhật cảm xúc!

source: Create Room
vi: Tạo Phòng Mới

source: Join Room
vi: Tham Gia Phòng

# enterCode
source: Enter pairing code
vi: Nhập mã kết nối

source: Waiting for partner...
vi: Đang chờ người ấy...

source: Copy Code
vi: Sao chép mã

source: Code copied!
vi: Đã sao chép mã!

source: Decision Tournament
vi: Giải đấu quyết định

source: Help us Decide!
vi: Ăn gì cũng được? Vậy chọn nhé!

# decisionWon
source: Decision Made!
vi: CHỐT ĐƠN!

source: Decision Rejected!
vi: KÈO BỊ TỪ CHỐI!

source: We will:
vi: Chúng ta sẽ:

source: Reason:
vi: Lý do:

# moodHappy
source: Happy
vi: Vui

# moodSad
source: Sad
vi: Buồn

# moodAngry
source: Angry
vi: Giận

# moodTired
source: Tired
vi: Mệt

# moodLoved
source: Loved
vi: Được yêu

# connectWithPartner
source: Connect with your partner
vi: Kết nối với người thương

source: Login failed
vi: Đăng nhập thất bại

source: Google Sign-In Error
vi: Lỗi đăng nhập Google

source: Continue with Google
vi: Tiếp tục với Google

source: Sign in Anonymously
vi: Vào ẩn danh

# pairingTitle
source: Pairing
vi: Ghép đôi

source: Your Pairing Code
vi: Mã ghép đôi của bạn

source: Enter Partner Code
vi: Nhập mã của đối phương

source: Connect
vi: Kết nối

source: Copied!
vi: Đã sao chép!

source: Generate Code
vi: Tạo mã

# generateCodeError
source: Failed to generate code
vi: Không thể tạo mã

# loginError
source: Error: {error}
vi: Lỗi: {error}

source: We have been together
vi: Chúng mình bên nhau

# daysCount
source: {count} Days
vi: {count} Ngày

source: Since: {date}
vi: Kể từ: {date}

source: Partner is feeling...
vi: Người ấy đang cảm thấy...

source: You are Paired!
vi: Đã kết đôi!

# howAreYouToday
source: How are you feeling today?
vi: Hôm nay bạn thế nào?

source: Why do you feel this way?
vi: Tại sao bạn cảm thấy vậy?

# needAtLeastTwoOptions
source: Need at least 2 options!
vi: Cần ít nhất 2 lựa chọn!

source: Create Tournament
vi: Tạo Giải Đấu

# enterOptionsForPartner
source: Enter options for your partner to choose!
vi: Nhập các lựa chọn để gửi cho người ấy chọn!

source: Quantity:
vi: Số lượng:

source: Option {index}
vi: Lựa chọn {index}

source: Send!
vi: Gửi đi!

# connectionError
source: Connection error or room deleted
vi: Lỗi kết nối hoặc phòng đã bị hủy

source: Go Back
vi: Quay lại

source: OR
vi: HOẶC

# partnerFeelingMessage
source: Partner feels {mood}: {desc}
vi: Người ấy cảm thấy {mood}: {desc}

source: Decision: {result}!
vi: Chốt đơn: {result}!

# decisionRejectedReason
source: Rejected: {reason}
vi: Phản đối: {reason}

source: Unknown reason
vi: Không rõ lý do

source: Invitation sent!
vi: Đã gửi lời mời!
